from django.db import models
from django.contrib.auth import get_user_model

user = get_user_model()




cars = [
    ('دنا','620,000,000 T : دنا'),
    ('دنا پلاس','720,500,000 T : دنا پلاس'),
    ('دنا پلاس توربو','765,000,000 T : دنا پلاس توربو'),
    ('دنا پلاس توربو اتوماتیک','1,150,000,000 T : دناپلاس توربو اتوماتیک'),
    ('سمند','560,000,000 T : سمند'),
    ('سمند سورن','520,000,000 T : سمند سورن'),
    ('سمند سورن پلاس','760,000,000 T : سمند سورن پلاس'),
    ('پژو 405 XU7','400,000,000 T : پژو 405 ایکس یو سون'),
    ('پژو 405 TU5','650,000,000 T : پژو 405 تیو فایو'),
    ('پژو پارس XU7','490,000,000 T : پژو پارس ایکس یو سون'),
    ('پژو پارس TU5','900,000,000 T : پژو پارس تیو فایو'),
    ('پژو 206 TU5','500,000,000 T : پژو 206 تیو فایو'),
    ('پژو 207 TU5','623,555,000 T : پژو 207 تیو فایو'),
    ('رانا','525,000,000 T : رانا'),
    ('رانا پلاس','630,000,000 T : رانا پلاس'),
    ('تارا V1 plus','940,000,000 T : تارا وی یک پلاس'),
    ('تارا V4','1,120,000,000 T : تارا وی فور'),
]
color_car = [
    ('مشکی','مشکی'),
    ('قرمز','قرمز'),
    ('سرمه ای','سرمه ای'),
    ('سفید','سفید'),
    ('یشمی','یشمی'),
    ('آبی','آبی'),
    ('مسی','مسی'),
    ('نقره ای','نقره ای'),
    ('خاکستری','خاکستری'),
    ('تیتانیومی','تیتانیومی'),
    ('فیلی','فیلی'),

]

price_sell = [
    ('دنا','620000000'),
    ('دنا پلاس','720500000'),
    ('دنا پلاس توربو','765000000'),
    ('دنا پلاس توربو اتوماتیک','1150000000'),
    ('سمند','560000000'),
    ('سمند سورن','520000000'),
    ('سمند سورن پلاس','760000000'),
    ('پژو 405 XU7','400000000'),
    ('پژو 405 TU5','650000000'),
    ('پژو پارس XU7','490000000'),
    ('پژو پارس TU5','900000000'),
    ('پژو 206 TU5','500000000'),
    ('پژو 207 TU5','623555000'),
    ('رانا','525000000'),
    ('رانا پلاس','630000000'),
    ('تارا V1 plus','940000000'),
    ('تارا V4','1120000000'),
]



class CarChoice(models.Model):

    car_choice   = models.CharField(max_length = 300, choices = cars, default = '1', verbose_name = 'انتخاب خودرو')
    color_choice = models.CharField(max_length = 300, choices = color_car, default = 'مشکی', verbose_name = 'رنگ')
    many_car = models.IntegerField(default = 1, verbose_name = 'تعداد')
    user = models.ForeignKey(user, on_delete = models.CASCADE, related_name = 'shopcar')

    def __str__(self):
        return f'برند : {self.car_choice}/ رنگ : {self.color_choice}'
    


    class Meta:
        db_table = 'shopcar'

