from tkinter import Tk,Button

def price():

    window = Tk()

    window.geometry('1000x700')
    window.title('لیست قیمت')
    btn = Button(window, text='ثبت سفارش', command = lambda:print('سفارش شما با موفقیت ثبت گردید'), width=10, height=2)
    btn.place(x=450, y=500)

    window.mainloop()

price()


#cars = [
#    ('1','620,000,000 T : دنا'),
#    ('2','720,500,000 T : دنا پلاس'),
#    ('3','765,000,000 T : دنا پلاس توربو'),
#    ('4','1,150,000,000 T : دناپلاس توربو اتوماتیک'),
#    ('5','560,000,000 T : سمند'),
#    ('6','520,000,000 T : سمند سورن'),
#    ('7','760,000,000 T : سمند سورن پلاس'),
#    ('8','400,000,000 T : پژو 405 ایکس یو سون'),
#    ('9','650,000,000 T : پژو 405 تیو فایو'),
#    ('10','490,000,000 T : پژو پارس ایکس یو سون'),
#    ('11','900,000,000 T : پژو پارس تیو فایو'),
#    ('12','500,000,000 T : پژو 206 تیو فایو'),
#    ('13','623,555,000 T : پژو 207 تیو فایو'),
#    ('14','525,000,000 T : رانا'),
#    ('15','630,000,000 T : رانا پلاس'),
#    ('16','940,000,000 T : تارا وی یک پلاس'),
#    ('17','1,120,000,000 T : تارا وی فور'),
#]
#
#sell = [
#    ('1','620000000'),
#    ('2','720500000'),
#    ('3','765000000'),
#    ('4','1150000000'),
#    ('5','560000000'),
#    ('6','520000000'),
#    ('7','760000000'),
#    ('8','400000000'),
#    ('9','650000000'),
#    ('10','490000000'),
#    ('11','900000000'),
#    ('12','500000000'),
#    ('13','623555000'),
#    ('14','525000000'),
#    ('15','630000000'),
#    ('16','940000000'),
#    ('17','1120000000'),
#]
#
#voroodi = int(input('Enter car: '))
#next_price = 0
#for j in range(len(cars)):
#
#    if voroodi == int(cars[j][0]) + 1:
#
#        sr = voroodi
#
#        for i in range(len(sell)):
#    
#            if sell[i][0] == str(sr):
#
#                price = int(sell[i][1])
#                next_price = price + 1
#                break
#        break
#print(f'مبلغ قابل پرداخت : {next_price}{' '}تومان') 